{"format": "graph-model", "generatedBy": "2.11.1", "convertedBy": "TensorFlow.js Converter v3.21.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "9"}]}}, "args_2:0": {"name": "args_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}, "args_1:0": {"name": "args_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}, "output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "9"}]}}}}, {"name": "args_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}}, {"name": "args_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}}, {"name": "Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16", "op": "NoOp", "input": ["^args_0", "^args_1", "^args_2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/transpose_1/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_69", "op": "Enter", "input": ["args_2", "^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_54", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_68", "op": "Enter", "input": ["args_1", "^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_55", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_56", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/time", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/transpose/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/Conv1D/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/Conv1D/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "6"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/Conv1D/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/Conv1D/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/transpose/perm", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_counter", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/dense/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/dense/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/input_control_node/_16"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_80", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_69", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_116"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_72", "op": "Enter", "input": ["Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_54"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_79", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_68", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_115"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_73", "op": "Enter", "input": ["Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_55"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_74", "op": "Enter", "input": ["Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_56"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_66", "op": "Enter", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/transpose", "op": "Transpose", "input": ["args_0", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_64", "op": "Enter", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_49", "op": "NoOp", "input": ["^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/dense/MatMul/ReadVariableOp", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/dense/BiasAdd/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/dense/MatMul/ReadVariableOp", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/dense/BiasAdd/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_83", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_72", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_119"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_84", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_73", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_120"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_85", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_74", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_121"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_77", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_66", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_113"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/transpose", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/Conv1D/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_75", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_64", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_111"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/Conv1D/ExpandDims", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/Conv1D/ExpandDims_1", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/re_lu/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/re_lu/Relu", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/Conv1D/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/Conv1D/ExpandDims", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/Conv1D/ExpandDims_1", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/Conv1D"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/re_lu_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/conv1d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/re_lu_1/Relu", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_71", "op": "Enter", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_82", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_71", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_118"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_70", "op": "Enter", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_67", "op": "Enter", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX21vZGVsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL1N0YXRlZnVsUGFydGl0aW9uZWRDYWxsL2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_81", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_70", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_117"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_78", "op": "Merge", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/enter/_67", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_114"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/cond/_62/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_77", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_81", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_75"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86", "op": "LoopCond", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/cond/_62/while/Less"]}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2_1_switch/_90", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_78", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_94", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_82", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_54_switch/_95", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_83", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_52_switch/_91", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_79", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_55_switch/_96", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_84", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_56_switch/_97", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_85", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/time_switch/_89", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_77", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_counter_switch/_87", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_75", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_53_switch/_92", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_80", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice_switch/_93", "op": "Switch", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/merge/_81", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/LoopCond/_86"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/exit/_102", "op": "Exit", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2_1_switch/_90"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/exit/_103", "op": "Exit", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_52_switch/_91"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98", "op": "Identity", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_counter_switch/_87:1"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/exit/_104", "op": "Exit", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_53_switch/_92"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/exit/_102", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/exit/_103", "^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_49", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_118", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_94:1", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_119", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_54_switch/_95:1", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_120", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_55_switch/_96:1", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_52_switch/_91:1", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_55_switch/_96:1", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_121", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_56_switch/_97:1", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/input/_138", "op": "Identity", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/time_switch/_89:1", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_117", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/strided_slice_switch/_93:1", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_body_control/_98"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/exit/_104", "^Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_49", "^StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_94:1", "Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/input/_138", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/input/_138", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/loop_counter_switch/_87:1", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/transpose_1", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "5"}, "shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/input/_54_switch/_95:1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/next_iteration/_113", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_model/StatefulPartitionedCall/StatefulPartitionedCall/lstm/PartitionedCall/while/body/_63/while/add_2", 